[
  {
    "id": "1",
    "name": "Berlin Smith",
    "imageURL": "https://images.unsplash.com/photo-1583394293214-28ded15ee548",
    "bio": "Chef Berlin Smith is a classically trained French chef who has spent years honing her craft in some of the most prestigious kitchens around the world. Her dishes are known for their elegance and simplicity, showcasing the freshest ingredients and the most delicate flavors.",
    "experience_years": 8,
    "num_recipes": 60,
    "likes": 900
  },
  {
    "id": "2",
    "name": "Carol Chen",
    "imageURL": "https://images.unsplash.com/photo-1577219491135-ce391730fb2c",
    "bio": "Chef Carol Chen is a Korean-American chef who has made a name for himself by fusing traditional Korean flavors with modern culinary techniques. His dishes are bold, flavorful, and always inventive, blending classic Korean dishes with unexpected twists and surprises.",
    "experience_years": 12,
    "num_recipes": 80,
    "likes": 1100
  },
  {
    "id": "3",
    "name": "Eva Hernandez",
    "imageURL": "https://images.unsplash.com/photo-1585358682246-23acb1561f6b",
    "bio": "Chef Eva Hernandez is a Mexican-American chef who has dedicated her career to elevating traditional Mexican cuisine to new heights. Her dishes are a celebration of the vibrant colors and bold flavors of Mexico, with fresh ingredients, complex spices, and unexpected flavor combinations.",
    "experience_years": 5,
    "num_recipes": 40,
    "likes": 500
  },
  {
    "id": "4",
    "name": "David Kim",
    "imageURL": "https://images.unsplash.com/photo-1654922207993-2952fec328ae",
    "bio": "Chef David Kim is a fourth-generation Italian chef who learned to cook in his family's restaurant in Naples. His dishes are classic Italian fare at its best, with handmade pastas, perfectly cooked risottos, and rich, flavorful sauces that transport you to the heart of Italy.",
    "experience_years": 10,
    "num_recipes": 70,
    "likes": 800
  },
  {
    "id": "5",
    "name": "Zainabu Namazzi",
    "imageURL": "https://images.unsplash.com/photo-1566554273541-37a9ca77b91f",
    "bio": "Chef Zainabu Namazzi is a self-taught chef who draws inspiration from her Ugandan heritage and her travels around the world. Her dishes are a fusion of flavors and cultures, combining traditional Pakistani spices with unexpected ingredients and techniques from other cuisines. The best chef from Uganda",

    "experience_years": 3,
    "num_recipes": 20,
    "likes": 100
  },
  {
    "id": "6",
    "name": "Frank Martin",
    "imageURL": "https://preview.milingona.co/themes/bakery/main/wp-content/uploads/2017/12/slide-1.jpg",
    "bio": "Chef David Chen is a Chinese-American chef who has made a name for himself by reimagining traditional Chinese dishes with modern techniques and ingredients. His dishes are a fusion of Chinese flavors and techniques with unexpected twists and turns, showcasing the best of both worlds.",
    "experience_years": 15,
    "num_recipes": 100,
    "likes": 1500
  }
]
