[
  {
    "id": "1",
    "chef_id": "1",
    "recipe_name": "Spaghetti Carbonara",
    "ingredients": [
      "1 lb spaghetti",
      "4 oz pancetta, diced",
      "3 large eggs",
      "3/4 cup grated Parmesan cheese",
      "1/2 tsp black pepper"
    ],
    "cooking_method": "Cook spaghetti in salted boiling water until al dente. Meanwhile, cook pancetta in a large skillet over medium heat until crispy. In a bowl, whisk together eggs, Parmesan cheese, and black pepper. Reserve 1 cup of pasta cooking water. Drain spaghetti and add it to the skillet with the pancetta. Remove from heat and add egg mixture, stirring quickly to coat pasta. If needed, add reserved pasta cooking water to thin out the sauce. Serve immediately.",
    "rating": 4.5
  },
  {
    "id": "2",
    "chef_id": "2",
    "recipe_name": "Margherita Pizza",
    "ingredients": [
      "1 lb pizza dough",
      "1/2 cup tomato sauce",
      "8 oz fresh mozzarella, sliced",
      "1/4 cup fresh basil leaves",
      "1 tbsp olive oil"
    ],
    "cooking_method": "Preheat oven to 500°F (260°C). Roll out pizza dough into a 12-inch round. Transfer to a pizza pan or baking sheet. Spread tomato sauce over the dough, leaving a 1/2-inch border. Arrange mozzarella slices over the sauce. Bake for 10-12 minutes, until crust is golden brown and cheese is melted. Sprinkle basil leaves over the pizza and drizzle with olive oil. Serve hot.",
    "rating": 4.8
  },
  {
    "id": "3",
    "chef_id": "3",
    "recipe_name": "Chicken Parmesan",
    "ingredients": [
      "4 boneless, skinless chicken breasts",
      "1 cup Italian seasoned breadcrumbs",
      "1/2 cup grated Parmesan cheese",
      "2 eggs, beaten",
      "1 cup tomato sauce",
      "4 oz fresh mozzarella, sliced"
    ],
    "cooking_method": "Preheat oven to 375°F (190°C). Pound chicken breasts to an even thickness. In a shallow dish, combine breadcrumbs and Parmesan cheese. In another shallow dish, beat eggs. Dip chicken breasts in eggs, then coat with breadcrumb mixture. Place chicken on a baking sheet and bake for 20-25 minutes, until cooked through. Spoon tomato sauce over chicken and top with mozzarella slices. Bake for another 5-7 minutes, until cheese is melted and bubbly. Serve hot.",
    "rating": 4.3
  },
  {
    "id": "4",
    "chef_id": "3",
    "recipe_name": "Bruschetta",
    "ingredients": [
      "4 slices Italian bread",
      "2 ripe tomatoes, diced",
      "2 cloves garlic, minced",
      "2 tbsp chopped fresh basil",
      "1 tbsp olive oil"
    ],
    "cooking_method": "Preheat oven to 400°F (200°C). Brush bread slices with olive oil and bake for 5-7 minutes, until lightly toasted. In a bowl, combine diced tomatoes, garlic, and chopped basil. Spoon tomato mixture over bread slices. Serve immediately.",
    "rating": 4.1
  },
  {
    "id": "5",
    "chef_id": "6",
    "recipe_name": "Minestrone Soup",
    "ingredients": [
      "2 tbsp olive oil",
      "1 onion, chopped",
      "2 garlic cloves, minced",
      "2 carrots, diced",
      "2 celery stalks, diced",
      "1 can (14.5 oz) diced tomatoes",
      "4 cups vegetable broth",
      "1 can (15 oz) cannellini beans, drained and rinsed",
      "1 cup uncooked ditalini pasta",
      "1 tsp dried oregano",
      "1 tsp dried basil",
      "1/2 tsp salt",
      "1/4 tsp black pepper",
      "1/4 cup chopped fresh parsley",
      "1/4 cup grated Parmesan cheese"
    ],
    "cooking_method": "In a large pot, heat olive oil over medium heat. Add onion and garlic and sauté for 2-3 minutes, until softened. Add carrots and celery and sauté for another 5 minutes. Add diced tomatoes, vegetable broth, cannellini beans, pasta, oregano, basil, salt, and black pepper. Bring to a boil, then reduce heat and simmer for 15-20 minutes, until pasta and vegetables are tender. Stir in chopped parsley. Serve hot with grated Parmesan cheese on top.",
    "rating": 4.7
  },
  {
    "id": "6",
    "chef_id": "2",
    "recipe_name": "Lasagna",
    "ingredients": [
      "1 lb ground beef",
      "1 onion, chopped",
      "2 garlic cloves, minced",
      "1 can (28 oz) crushed tomatoes",
      "1 can (6 oz) tomato paste",
      "1/2 cup water",
      "1 tsp dried basil",
      "1 tsp dried oregano",
      "1/2 tsp salt",
      "1/4 tsp black pepper",
      "12 lasagna noodles",
      "1 lb ricotta cheese",
      "2 cups shredded mozzarella cheese",
      "1/4 cup grated Parmesan cheese"
    ],
    "cooking_method": "Preheat oven to 375°F (190°C). In a large skillet, cook ground beef, onion, and garlic over medium heat until browned. Drain excess fat. Stir in crushed tomatoes, tomato paste, water, basil, oregano, salt, and black pepper. Simmer for 20-30 minutes, stirring occasionally. Meanwhile, cook lasagna noodles according to package directions. In a separate bowl, mix together ricotta cheese and 1 cup of shredded mozzarella cheese. To assemble lasagna, spread a thin layer of meat sauce in the bottom of a 9x13-inch baking dish. Top with a layer of cooked noodles, then a layer of ricotta cheese mixture. Repeat layers",
    "rating": 4.7
  },
  {
    "id": "7",
    "chef_id": "4",
    "recipe_name": "Chicken Alfredo",
    "ingredients": [
      "8 oz fettuccine",
      "2 boneless, skinless chicken breasts, sliced",
      "2 tbsp olive oil",
      "1/4 cup butter",
      "2 garlic cloves, minced",
      "2 cups heavy cream",
      "1/2 tsp salt",
      "1/4 tsp black pepper",
      "1 cup grated Parmesan cheese",
      "1/4 cup chopped fresh parsley"
    ],
    "cooking_method": "Cook fettuccine according to package directions. In a large skillet, heat olive oil over medium-high heat. Add sliced chicken and sauté until cooked through, about 5-7 minutes. Remove chicken from skillet and set aside. In the same skillet, melt butter over medium heat. Add minced garlic and sauté for 1-2 minutes. Add heavy cream, salt, and black pepper, stirring constantly. Bring to a simmer and cook for 5-7 minutes, until sauce has thickened slightly. Stir in grated Parmesan cheese and chopped parsley. Add cooked fettuccine and chicken back into the skillet, tossing to coat in the sauce. Serve hot.",
    "rating": 4.8
  },
  {
    "id": "8",
    "chef_id": "1",
    "recipe_name": "Beef Stroganoff",
    "ingredients": [
      "1 lb beef sirloin steak, thinly sliced",
      "1 onion, chopped",
      "2 garlic cloves, minced",
      "2 tbsp butter",
      "1 tbsp vegetable oil",
      "1 cup sliced mushrooms",
      "1 tbsp all-purpose flour",
      "1 cup beef broth",
      "1 tsp Dijon mustard",
      "1/2 tsp salt",
      "1/4 tsp black pepper",
      "1/2 cup sour cream",
      "8 oz egg noodles, cooked according to package directions",
      "2 tbsp chopped fresh parsley"
    ],
    "cooking_method": "In a large skillet, heat butter and vegetable oil over medium-high heat. Add beef slices and sauté for 2-3 minutes, until browned. Remove beef from skillet and set aside. In the same skillet, sauté onion and garlic for 1-2 minutes, until softened. Add sliced mushrooms and sauté for another 2-3 minutes. Sprinkle all-purpose flour over vegetables and stir to combine. Gradually add beef broth, stirring constantly, until sauce has thickened. Stir in Dijon mustard, salt, and black pepper. Return beef to skillet and stir to coat in sauce. Simmer for 5-7 minutes. Remove from heat and stir in sour cream. Serve hot over cooked egg noodles, garnished with chopped parsley.",
    "rating": 4.6
  },
  {
    "id": "9",
    "chef_id": "5",
    "recipe_name": "Shakshuka",
    "ingredients": [
      "2 tbsp olive oil",
      "1 onion, chopped",
      "2 garlic cloves, minced",
      "1 red bell pepper, chopped",
      "1 can (14.5 oz) diced tomatoes",
      "1 tsp paprika",
      "1/2 tsp ground cumin",
      "1/2 tsp salt",
      "1/4 tsp black pepper",
      "4-6 eggs",
      "1/4 cup crumbled feta cheese",
      "1/4 cup chopped fresh parsley"
    ],
    "cooking_method": "In a large skillet, heat olive oil over medium-high heat. Add chopped onion and sauté for 2-3 minutes, until softened. Add minced garlic and sauté for another minute. Add chopped red bell pepper and sauté for 2-3 minutes, until softened. Add diced tomatoes, paprika, ground cumin, salt, and black pepper, stirring to combine. Bring mixture to a simmer and cook for 5-7 minutes, until slightly thickened. Using a spoon, create 4-6 wells in the tomato mixture. Crack an egg into each well. Cover skillet and cook for 5-7 minutes, until egg whites are set but yolks are still runny. Sprinkle crumbled feta cheese over eggs and tomato mixture. Garnish with chopped fresh parsley. Serve hot.",
    "rating": 4.5
  },
  {
    "id": "10",
    "chef_id": "3",
    "recipe_name": "Eggplant Parmesan",
    "ingredients": [
      "2 medium eggplants",
      "2 cups all-purpose flour",
      "4 cups Italian-seasoned breadcrumbs",
      "4 cups tomato sauce",
      "2 cups grated Parmesan cheese",
      "2 cups shredded mozzarella cheese",
      "2 eggs",
      "1 cup milk",
      "1 tablespoon olive oil",
      "Salt and pepper to taste"
    ],
    "cooking_method": "1. Slice the eggplants into 1/2 inch thick rounds. \n2. Mix the flour and season with salt and pepper. \n3. Beat the eggs in a bowl with milk. \n4. Coat the eggplant slices with flour mixture, then dip them in the egg mixture and coat with breadcrumbs. \n5. Heat the olive oil in a frying pan and fry the eggplant slices until golden brown. \n6. Preheat the oven to 375°F. \n7. Spread a layer of tomato sauce in a baking dish, then arrange the eggplant slices on top. \n8. Cover the eggplant with more tomato sauce, grated Parmesan cheese, and shredded mozzarella cheese. \n9. Repeat the layers until all ingredients are used. \n10. Bake in the oven for 25-30 minutes, or until the cheese is melted and bubbly. \n11. Serve hot.",
    "rating": 4.8
  },
  {
    "id": "11",
    "chef_id": "1",
    "recipe_name": "Fettuccine Alfredo",
    "ingredients": [
      "1 lb fettuccine pasta",
      "1 cup heavy cream",
      "1/2 cup unsalted butter",
      "2 cups grated Parmesan cheese",
      "2 garlic cloves, minced",
      "Salt and pepper to taste"
    ],
    "cooking_method": "1. Cook the fettuccine pasta according to the package instructions. \n2. In a saucepan, melt the butter over medium heat. \n3. Add minced garlic and cook for 1-2 minutes. \n4. Pour in the heavy cream and bring to a simmer. \n5. Add grated Parmesan cheese and whisk until the cheese is melted and the sauce is smooth. \n6. Add salt and pepper to taste. \n7. Drain the cooked pasta and add it to the saucepan. \n8. Toss the pasta with the sauce until well coated. \n9. Serve hot.",
    "rating": 4.5
  },
  {
    "id": "12",
    "chef_id": "6",
    "recipe_name": "Osso Buco",
    "ingredients": [
      "4 veal shanks",
      "1 onion, diced",
      "2 carrots, diced",
      "2 celery stalks, diced",
      "4 garlic cloves, minced",
      "2 cups beef broth",
      "1 cup dry white wine",
      "1 cup canned diced tomatoes",
      "2 tablespoons olive oil",
      "Salt and pepper to taste"
    ],
    "cooking_method": "1. Preheat the oven to 350°F. \n2. Heat the olive oil in a dutch oven over medium-high heat. \n3. Season the veal shanks with salt and pepper, then brown them in the dutch oven on all sides. \n4. Remove the shanks and set aside. \n5. Add the diced onions, carrots, celery, and minced garlic to the dutch oven. Cook for 5-7 minutes, or until the vegetables are tender. \n6. Add the canned diced tomatoes, beef broth, and dry white wine to the dutch oven. \n7. Return the veal shanks to the dutch oven, and spoon some of the sauce over the shanks. \n8. Cover the dutch oven with a lid and bake in the preheated oven for 2-3 hours, or until the meat is tender and falling off the bone. \n9. Serve hot with the sauce spooned over the top.",
    "rating": 4.7
  },
  {
    "id": "13",
    "chef_id": "5",
    "recipe_name": "Risotto with Porcini Mushrooms",
    "ingredients": [
      "1 cup arborio rice",
      "4 cups chicken broth",
      "1/2 cup dry white wine",
      "1/2 cup grated Parmesan cheese",
      "1/2 cup dried porcini mushrooms",
      "1 onion, diced",
      "2 garlic cloves, minced",
      "2 tablespoons butter",
      "2 tablespoons olive oil",
      "Salt and pepper to taste"
    ],
    "cooking_method": "1. In a small bowl, soak the dried porcini mushrooms in hot water for 30 minutes. Drain and chop the mushrooms. \n2. In a saucepan, heat the chicken broth over medium heat. \n3. In a separate pan, melt the butter and olive oil over medium-high heat. \n4. Add the diced onion and minced garlic, and cook until the onion is translucent. \n5. Add the arborio rice to the pan and stir until coated with the butter and oil. \n6. Add the chopped porcini mushrooms and white wine, and stir until the wine is absorbed. \n7. Add a ladleful of the hot chicken broth to the pan and stir until the broth is absorbed. \n8. Repeat this process, adding more broth one ladleful at a time, and stirring constantly until the rice is cooked and the mixture is creamy. \n9. Stir in grated Parmesan cheese and season with salt and pepper to taste. \n10. Serve hot.",
    "rating": 4.6
  },
  {
    "id": "14",
    "chef_id": "4",
    "recipe_name": "Caprese Salad",
    "ingredients": [
      "4 ripe tomatoes, sliced",
      "8 oz fresh mozzarella cheese, sliced",
      "1/2 cup fresh basil leaves",
      "2 tablespoons balsamic vinegar",
      "2 tablespoons olive oil",
      "Salt and pepper to taste"
    ],
    "cooking_method": "1. Arrange the tomato and mozzarella slices alternately on a platter or individual plates. \n2. Sprinkle with fresh basil leaves. \n3. Drizzle with balsamic vinegar and olive oil. \n4. Season with salt and pepper to taste. \n5. Serve cold.",
    "rating": 4.8
  },
  {
    "id": "15",
    "chef_id": "6",
    "recipe_name": "Panna Cotta",
    "ingredients": [
      "2 cups heavy cream",
      "1/2 cup granulated sugar",
      "2 teaspoons vanilla extract",
      "1/4 cup cold water",
      "1 envelope unflavored gelatin"
    ],
    "cooking_method": "1. In a saucepan, heat the heavy cream and granulated sugar over medium heat, stirring constantly, until the sugar dissolves. \n2. Remove from heat and stir in vanilla extract. \n3. In a small bowl, sprinkle unflavored gelatin over cold water and let stand for 5 minutes. \n4. Add the gelatin mixture to the cream mixture and stir until the gelatin dissolves. \n5. Pour the mixture into 6 individual ramekins or a large serving dish. \n6. Refrigerate for at least 2 hours, or until set. \n7. To serve, run a knife around the edge of each ramekin and invert onto a plate. \n8. Serve cold with fresh berries or fruit sauce.",
    "rating": 4.5
  }
]
